IRP/src/Catalogs/LockDataModificationReasons/LockDataModificationReasons.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>LockDataModificationReasons</name>
  <attributes>
    <name>ForAllUsers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DisableRule</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SetOneRuleForAllObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Attribute</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ComparisonType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Value</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SetValueAsCode</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RuleList</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ComparisonType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DisableRule</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SetValueAsCode</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>UserList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessGroupList</name>
    <attributes>
      <name>AccessGroup</name>
      <type>
        <types>CatalogRef.AccessGroups</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/LockDataModificationReasons/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;	
	
	LockDataModificationPrivileged.SaveRuleSettings(ThisObject);
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure


Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If DisableRule Then
		Return;
	EndIf;
	
	If Not ForAllUsers Then
		If Not UserList.Count() AND Not AccessGroupList Then
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_067);
			Cancel = True;
		EndIf;
	EndIf;	
	If SetOneRuleForAllObjects Then
		If IsBlankString(Attribute) Then
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().Error_010, ThisObject.Metadata().Attributes.Attribute.Synonym), "Object.Attribute");
			Cancel = True;
		EndIf;
		If IsBlankString(ComparisonType) Then
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().Error_010, ThisObject.Metadata().ComparisonType.ComparisonType.Synonym), "Object.ComparisonType");
			Cancel = True;
		EndIf;
		If SetValueAsCode AND IsBlankString(Value) Then
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().Error_010, ThisObject.Metadata().ComparisonType.Value.Synonym), "Object.Value");
			Cancel = True;
		EndIf;		
	Else
		For Index = 0 To RuleList.Count() - 1 Do
			If IsBlankString(RuleList[Index].Attribute) Then
				CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R().Error_010, ThisObject.Metadata().TabularSections.RuleList.Attributes.Attribute.Synonym), 
					"Object.RuleList[" + Format(Index, "NG=") + "].Attribute");
				Cancel = True;
			EndIf;
			If IsBlankString(RuleList[Index].ComparisonType) Then
				CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R().Error_010, ThisObject.Metadata().TabularSections.RuleList.Attributes.ComparisonType.Synonym), 
					"Object.RuleList[" + Format(Index, "NG=") + "].ComparisonType");
				Cancel = True;
			EndIf;
			If RuleList[Index].SetValueAsCode AND IsBlankString(RuleList[Index].Value) Then
				CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R().Error_010, ThisObject.Metadata().TabularSections.RuleList.Attributes.Value.Synonym), 
					"Object.RuleList[" + Format(Index, "NG=") + "].Value");
				Cancel = True;
			EndIf;		
		EndDo;
	EndIf;
EndProcedure
